In [13]:
import pandas as pd
import numpy as np

In [3]:
data = {
    "Name": ["Ali", "Ahmed", "Sara", "Ayesha", "Usaid"],
    "Age": [18, 19, 18, 20, 19],
    "Marks": [78, 85, 90, 72, 88]
}

df = pd.DataFrame(data)

In [4]:
df.head(3)

    Name  Age  Marks
0    Ali   18     78
1  Ahmed   19     85
2   Sara   18     90

In [5]:
df.tail(2)

     Name  Age  Marks
3  Ayesha   20     72
4   Usaid   19     88

In [6]:
df.shape

(5, 3)

In [8]:
df.columns

Index(['Name', 'Age', 'Marks'], dtype='object')

In [9]:
print(df['Marks'].mean())

82.6

In [10]:
maxmarks = df['Marks'].idxmax()
std_name = df.loc[maxmarks, 'Name']
print(std_name)

Sara

In [14]:
sort = df.sort_values(by="Marks")
sort

     Name  Age  Marks
3  Ayesha   20     72
0     Ali   18     78
1   Ahmed   19     85
4   Usaid   19     88
2    Sara   18     90

In [17]:
df.query('Marks > 80')

    Name  Age  Marks
1  Ahmed   19     85
2   Sara   18     90
4  Usaid   19     88

In [21]:
df.query('Marks > 80 & Age == 19')

    Name  Age  Marks
1  Ahmed   19     85
4  Usaid   19     88

In [25]:
df['Passed'] = np.where(df['Marks'] >= 75, "True", "False")
df

     Name  Age  Marks Passed
0     Ali   18     78   True
1   Ahmed   19     85   True
2    Sara   18     90   True
3  Ayesha   20     72  False
4   Usaid   19     88   True

In [26]:
df['Marks'] + 5

0    83
1    90
2    95
3    77
4    93
Name: Marks, dtype: int64

In [33]:
passed = df['Passed'].sum()
passed

'TrueTrueTrueFalseTrue'